Huang-Zifeng/NUEDC-2023/STM32F103/STM32F103ZETx_HAL_IPS114_Hardware_SPI_Demo/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IPS114_REST_Pin GPIO_PIN_4
#define IPS114_REST_GPIO_Port GPIOA
#define IPS114_SCL_Pin GPIO_PIN_5
#define IPS114_SCL_GPIO_Port GPIOA
#define IPS114_SDA_Pin GPIO_PIN_7
#define IPS114_SDA_GPIO_Port GPIOA
#define IPS114_CS_Pin GPIO_PIN_4
#define IPS114_CS_GPIO_Port GPIOC
#define IPS114_BL_Pin GPIO_PIN_5
#define IPS114_BL_GPIO_Port GPIOC
#define IPS114_DC_Pin GPIO_PIN_0
#define IPS114_DC_GPIO_Port GPIOB
#define PIN_1_Pin GPIO_PIN_15
#define PIN_1_GPIO_Port GPIOD
#define K1_Pin GPIO_PIN_2
#define K1_GPIO_Port GPIOG
#define K1_EXTI_IRQn EXTI2_IRQn
#define K2_Pin GPIO_PIN_3
#define K2_GPIO_Port GPIOG
#define K2_EXTI_IRQn EXTI3_IRQn
#define K3_Pin GPIO_PIN_4
#define K3_GPIO_Port GPIOG
#define K4_Pin GPIO_PIN_5
#define K4_GPIO_Port GPIOG
#define K4_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
